app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-05-21 21:48:48.470958"], ["id", 1]]
---
  def update
    @school_class.update(school_class_params(:title, :room_number))