app/controllers/students_controller.rb

  def update
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-05-21 21:48:48.639429"], ["id", 1]]